webapp/app/views/main/index.html.erb


        <% if (Run.where(status: 0).count > 0) %>
          <% Run.where(status: 0).limit(4).each do |run| %>
---
SELECT count(*) AS `count` FROM `runs` WHERE (`status` = 1) LIMIT 1
SELECT * FROM `runs` WHERE (`status` = 1) LIMIT 4

                        <div class="row ml-1">
                          <h5 class="mb-3 ml-5"><%= Order.where(run_id: run.id).count.to_s + '/' + run.order_cap.to_s %></h5>
---
SELECT count(*) AS `count` FROM `orders` WHERE (`run_ID` = 1) LIMIT 1

        <h2>My Current Active Orders</h2>
        <% Order.where(status: 1).limit(6).each do |order| %>
---
SELECT * FROM `orders` WHERE (`status` = 1) LIMIT 6

                <div class="col-4 no-gutters align-items-center">
                  <img src=User.where(id: Run[order.run_id]runner_id).filename alt="..." class="img-thumbnail">
---
SELECT * FROM `runs` WHERE `id` = 1
SELECT * FROM `users` WHERE `id` = 1


          <% if !Order.where(run_id: run.id, user_id: @user.id).empty? %>
---
SELECT 1 AS `one` FROM `orders` WHERE ((`run_id` = 2) AND (`user_id` = 1)) LIMIT 1

        <div class="container">
          <% Comment.where(run_id: run.id).order(:id).each do |comment| %>
---
SELECT * FROM `comments` WHERE (`run_id` = 2) ORDER BY `id`