webapp/app/views/main/orders.html.erb

          <div class="tab-pane fade show active" id="list-home" role="tabpanel" aria-labelledby="list-home-list">
            <% Order.where(status: 1).limit(6).each do |order| %>
---
SELECT * FROM `orders` WHERE (`status` = 1) LIMIT 6

                    <div class="col-4 no-gutters align-items-center">
                      <img src=User.where(id: Run.where(id: order.run_id).runner_id).filename alt="..." class="img-thumbnail">
---
SELECT * FROM `runs` WHERE `id` = 1
SELECT * FROM `users` WHERE `id` = 8