webapp/app/controllers/main_controller.rb

  def register_post
    render(plain: "Missing Email") and return if params[:email].nil? || params[:email].empty?
    render(plain: "Invalid email.") and return unless params[:email] =~ /^\S+@\S+\.\S+$/
    render(plain: "User #{params[:email]} already exists.") and return if User[:email => params[:email]]
    render(plain: "Missing first name.") and return if params[:first_name].nil? || params[:first_name].empty?
    render(plain: "Missing last name.") and return if params[:last_name].nil? || params[:last_name].empty?
    render(plain: "Missing password.") and return if params[:password].nil? || params[:password].empty?
    activation = rand 0..9999
    user = User.new(:email => params[:email], :first_name => params[:first_name],
                    :last_name => params[:last_name], :is_verified => 0,
                    :phone_number => params[:phone_number], :credits => 1000, :rating_score=>0,
                    :rating_count=>0, :activation_code=>activation)
    user.set_password(params[:password])
    user.save_changes
    text_body = <<-EOS
    Hello,

    This is a notification that #{user.first_name} #{user.last_name} has created an account on HasTea.
    If this was you, please use activation code #{user.activation_code} to activate your account at url.com/activation
---
INSERT INTO `users` (`email`, `first_name`, `last_name`, `is_verified`, `phone_number`, `credits`, `rating_score`, `rating_count`, `activation_code`, `salt`, `password`) VALUES ('brinsfield.cole@gmail.com', 'Cole', 'Brinsfield', 0, 6504688601, 1000, 0, 0, 0, 'UK7kZpyJquG89ZEf8AQMTGmqiPYIhaYy', 'aAFncoI1hwvU3ifzmtmImPXzu5EzYFXY\n')
SELECT * FROM `users` WHERE (`email` = 'brinsfield.cole@gmail.com') LIMIT 1

  def activation_post
    render(plain: "Missing email") and return if params[:email].nil? || params[:email].empty?
    render(plain: "Invalid email.") and return unless params[:email] =~ /^\S+@\S+\.\S+$/
    user = User.first(email: params[:email])

    render(plain: "Invalid activation code.") and return if (params[:activation].nil? || !params[:activation].to_i.between?(0,9999))
    render(plain: "Wrong activation code.") and return if (user.activation_code != params[:activation].to_i)

    user.is_verified = 1
    user.save_changes
---
SELECT * FROM `users` WHERE (`email` = 'brinsfield.cole@gmail.com') LIMIT 1
UPDATE `users` SET `is_verified` = 1 WHERE (`id` = 8) LIMIT 1

  def new_order
    render(plain: "Missing order") and return if params[:order_desc].nil? || params[:order_desc].empty?
    render(plain: "Missing run") and return if params[:run_id].nil?
    order = Order.new(:run_id => params[:run_id], :user_id=>@user.id, :order_desc => params[:order_desc], :status => 0, :cost => 0)
    order.save()
---
INSERT INTO `orders` (`run_id`, `user_id`, `order_desc`, `status`, `cost`) VALUES (1, 8, 'all the boba yes thank you', 1, 0)

  def new_run_post
    render(plain: "No location selected") and return if params[:business_id].nil?
    render(plain: "Max Orders not set") and return if params[:max_orders].nil?
    render(plain: "Date not set") and return if params[:date].nil?
    render(plain: "Time not set") and return if params[:time].nil?
    render(plain: "No destination address set") and return if params[:pickup_addr].nil?

    run = Run.new(:runner_id => @user.id,
                  :business_id => params[:business_id],
                  :datetime => Time.strptime(params[:date]+" "+params[:time], "%m/%d/%Y %l:%M %p"),
                  :order_cap => params[:max_orders],
                  :status => 0,
                  :delivery_method => params[:delivery_method],
                  :pickup_addr => params[:pickup_addr],
                  :notes => params[:notes])
    p run
    run.save
---
INSERT INTO `runs` (`runner_id`, `business_id`, `datetime`, `order_cap`, `status`, `delivery_method`, `pickup_addr`, `notes`) VALUES (1, 'ChIJ_Q4MBogT6YARYLgp4THTXBA', '2019-01-10 20:09:00', 2, 0, 0, 'kappa', '')